app/views/shared/_abouttradeproccess.html.erb


<% if Abouttrade.exists? %>
---
SELECT 1 AS one FROM "abouttrades" LIMIT $1  [["LIMIT", 1]]