app/views/shared/_aboutloan.html.erb

SELECT 1 AS one FROM "abouts" LIMIT $1  [["LIMIT", 1]]
---
<% if About.exists? %>