app/views/shared/_banner.html.erb

<% if Banner.exists? %>
---
SELECT 1 AS one FROM "banners" LIMIT $1  [["LIMIT", 1]]