app/views/shared/_blogs.html.erb

SELECT 1 AS one FROM "blogs" LIMIT $1  [["LIMIT", 1]]
---
<% if Blog.exists? %>