app/views/shared/_feedbacks.html.erb

SELECT 1 AS one FROM "feedbacks" LIMIT $1  [["LIMIT", 1]]
---
<% if Feedback.exists? %>