app/views/shared/_footer.html.erb


<% if Welcome.exists? %>
---
SELECT 1 AS one FROM "welcomes" LIMIT $1  [["LIMIT", 1]]