app/views/shared/_plans.html.erb

<% if Plan.exists? %>
---
SELECT 1 AS one FROM "plans" LIMIT $1  [["LIMIT", 1]]