app/views/shared/_section.html.erb

SELECT 1 AS one FROM "sections" LIMIT $1  [["LIMIT", 1]]
---

            <% if Section.exists? %>