app/views/shared/_services.html.erb


<% if Service.exists? %>
---
SELECT 1 AS one FROM "services" LIMIT $1  [["LIMIT", 1]]