app/views/withdraws/index.html.erb

SELECT "withdraws".* FROM "withdraws" WHERE "withdraws"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
---
            <tbody>
              <% if Withdraw.where(user_id: current_user).exists?%>