app/views/deposits/index.html.erb

SELECT "deposits".* FROM "deposits" WHERE "deposits"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
SELECT 1 AS one FROM "deposits" WHERE "deposits"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  <tbody>
    <% if Deposit.where(user_id: current_user).exists?%>