app/views/deposits/new.html.erb

<div class="row">
  <% if Plan.exists? %>
---
SELECT 1 AS one FROM "plans" LIMIT $1  [["LIMIT", 1]]