app/controllers/accounts_controller.rb

  def index
    @welcomes = Welcome.all.order('created_at DESC')

    @users = User.where(user_id: current_user)
    @accounts = Account.where(user_id: current_user).order('created_at DESC')
---
SELECT "welcomes".* FROM "welcomes" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]

  def new
    @plans = Plan.all.order('created_at DESC')
---
SELECT "plans".* FROM "plans" ORDER BY created_at DESC

  def create
    @account = current_user.accounts.build(account_params)
    @account.user_id = current_user.id
    if @account.save
      user = User.find_by_id(@account.user_id)
---
INSERT INTO "accounts" ("wallet", "balance", "user_id", "created_at", "updated_at", "first_name", "last_name", "address", "city", "state", "country", "slug", "status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]