app/controllers/deposits_controller.rb

def index
  @welcomes = Welcome.all

  @deposits = Deposit.where(user_id: current_user).order('created_at DESC')
  @accounts = Account.where(user_id: current_user).order('created_at DESC')
---
SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
SELECT "deposits".* FROM "deposits" WHERE "deposits"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]

def new
  @welcomes = Welcome.all
  @pms = Pm.all.order('created_at ASC')
  @plans = Plan.all
---
SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
SELECT "plans".* FROM "plans"