app/controllers/trades_controller.rb

  def index
    @trades = Trade.where(user_id: current_user).order("created_at DESC")

        @users = User.where(user_id: current_user)
        @accounts = Account.where(user_id: current_user).order('created_at DESC')
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]