app/controllers/welcomes_controller.rb

def index
  @welcomes = Welcome.all
---
SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]