app/controllers/withdraws_controller.rb

  def index
    @withdraws = Withdraw.where(user_id: current_user).order('created_at DESC')
    @welcomes = Welcome.all
---
SELECT "withdraws".* FROM "withdraws" WHERE "withdraws"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]