app/views/trades/_history.html.erb

  <div class="row">
    <% if Trade.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "trades" WHERE "trades"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]