app/views/layouts/application.html.erb

<head>
  <%  @welcomes = Welcome.all  %>
---
SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]