app/views/accounts/_tables.html.erb

<div class="row">
  <% if Deposit.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "deposits" WHERE "deposits"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]