app/views/accounts/_topbox.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
---
                <i class="mdi mdi-checkbox-marked-circle-outline me-1"></i></span>
                <%= Account.where(user_id: current_user.id).count %> active accounts</p>

SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
SELECT 1 AS one FROM "accounts" WHERE "accounts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
                <p class="text-dark mb-1 fw-semibold">Trades</p>
                <h4 class="my-1"><%= Account.where(user_id: current_user.id).count %></h4>

                <% if Account.where(user_id: current_user.id).exists? %>

SELECT COUNT(*) FROM "deposits" WHERE "deposits"."user_id" = $1  [["user_id", 1]]
---
                  <p class="text-dark mb-1 fw-semibold">Transactions</p>
                  <h4 class="my-1"><%= Deposit.where(user_id: current_user.id).count %></h4>

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "accounts" WHERE "accounts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

                  <% if Account.where(user_id: current_user.id).exists? %>