app/views/accounts/new.html.erb

SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
---
                            <div class="card-body p-0 auth-header-box">
        <% @welcomes = Welcome.all %>